.emacs.d/readme.org
:PROPERTIES:
#+TITLE: umi's config
#+AUTHOR: umi
#+TOC: toc-org

* Umi's Config                                                          :TOC:
  - [[#editor-settings][EDITOR SETTINGS]]
  - [[#important-programs-to-load-first][IMPORTANT PROGRAMS TO LOAD FIRST]]
  - [[#dired][DIRED]]
  - [[#navigation][NAVIGATION]]
  - [[#project][PROJECT]]
  - [[#lsp][LSP]]
  - [[#utils][UTILS]]
  - [[#git][GIT]]
  - [[#visuals][VISUALS]]
  - [[#org][ORG]]

** EDITOR SETTINGS
[[file:settings/readme.org][Configuration]]
#+begin_src emacs-lisp
  (org-babel-load-file
   (expand-file-name
    "settings/readme.org"
    user-emacs-directory))
#+end_src

** IMPORTANT PROGRAMS TO LOAD FIRST
*** Elpaca Package Manager
Installing Elpaca
#+begin_src emacs-lisp
  (defvar elpaca-installer-version 0.12)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-sources-directory (expand-file-name "sources/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
  			      :ref nil :depth 1 :inherit ignore
  			      :files (:defaults "elpaca-test.el" (:exclude "extensions"))
  			      :build (:not elpaca-activate)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-sources-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (<= emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
  	(if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
  		  ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
  						  ,@(when-let* ((depth (plist-get order :depth)))
  						      (list (format "--depth=%d" depth) "--no-single-branch"))
  						  ,(plist-get order :repo) ,repo))))
  		  ((zerop (call-process "git" nil buffer t "checkout"
  					(or (plist-get order :ref) "--"))))
  		  (emacs (concat invocation-directory invocation-name))
  		  ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
  					"--eval" "(byte-recompile-directory \".\" 0 'force)")))
  		  ((require 'elpaca))
  		  ((elpaca-generate-autoloads "elpaca" repo)))
  	    (progn (message "%s" (buffer-string)) (kill-buffer buffer))
  	  (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (let ((load-source-file-function nil)) (load "./elpaca-autoloads"))))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))
#+End_src

Enable the Elpaca use-package macro

#+begin_src emacs-lisp
  ;; Install a package via the elpaca macro
  ;; See the "recipes" section of the manual for more details.

  ;; (elpaca example-package)

  ;; Install use-package support
  (elpaca elpaca-use-package
    ;; Enable use-package :ensure support for Elpaca.
    (elpaca-use-package-mode)
    (setq elpaca-use-package-by-default t))
#+end_src

Wait for Elpaca to be installed
#+begin_src emacs-lisp
  (elpaca-wait)
#+end_src

*** Evil
Unsetting evil-want-keybinding
#+begin_src emacs-lisp
  (setq evil-want-keybinding nil)
#+end_src

Installing Evil
#+begin_src emacs-lisp
  (use-package evil)
#+end_src

Installing Evil-Collection
#+begin_src emacs-lisp
  (use-package evil-collection
    :after evil)
#+end_src

[[file:evil/readme.org][Configuration]]
#+begin_src emacs-lisp
  (org-babel-load-file
   (expand-file-name
    "evil/readme.org"
    user-emacs-directory))
#+end_src

*** General
Installing General 
#+begin_src emacs-lisp
  (use-package general :demand t)
#+end_src

[[file:general/readme.org][Configuration]]
#+begin_src emacs-lisp
  (org-babel-load-file
   (expand-file-name
    "general/readme.org"
    user-emacs-directory))
#+end_src

** DIRED
Installing Dired-Narrow
#+begin_src emacs-lisp
  (use-package dired-narrow)
#+end_src

[[file:dired/readme.org][Configuration]]
#+begin_src emacs-lisp
  (org-babel-load-file
   (expand-file-name
    "dired/readme.org"
    user-emacs-directory))
#+end_src

** NAVIGATION
Installing Helm
#+begin_src emacs-lisp
  (use-package helm)
#+end_src

Installing Helm-Rg
#+begin_src emacs-lisp
  (use-package helm-rg
    :after helm)
#+end_src

Installing Avy
#+begin_src emacs-lisp
  (use-package avy)
#+end_src

[[file:navigation/readme.org][Configuration]]
#+begin_src emacs-lisp
  (org-babel-load-file
   (expand-file-name
    "navigation/readme.org"
    user-emacs-directory))
#+end_src

** PROJECT
[[file:project/readme.org][Configuration]]
#+begin_src emacs-lisp
  (org-babel-load-file
   (expand-file-name
    "project/readme.org"
    user-emacs-directory))
#+end_src

** LSP
Installing Lsp-Mode
#+begin_src emacs-lisp
  (use-package lsp-mode
    :commands (lsp lsp-deferred))
#+end_src

Installing Lsp-UI
#+begin_src emacs-lisp
  (use-package lsp-ui)
#+end_src

Installing Company
#+begin_src emacs-lisp
  (use-package company)
#+end_src

Installing Helm-Xref
#+begin_src emacs-lisp
  (use-package helm-xref
    :after helm)
#+end_src

Installing Helm-Lsp
#+begin_src emacs-lisp
  (use-package helm-lsp
    :after (helm lsp-mode))
#+end_src

Installing Yasnippet
#+begin_src emacs-lisp
  (use-package yasnippet)
#+end_src

Installing Format-All
#+begin_src emacs-lisp
  (use-package format-all)
#+end_src

Installing Flycheck
#+begin_src emacs-lisp
  (use-package flycheck)
#+end_src

Installing Helm-Flycheck
#+begin_src emacs-lisp
  (use-package helm-flycheck
    :after (helm flycheck))
#+end_src

Installing Flycheck-Inline
#+begin_src emacs-lisp
  (use-package flycheck-inline
    :after flycheck)
#+end_src

[[file:lsp/readme.org][Configuration]]
#+begin_src emacs-lisp
  (org-babel-load-file
   (expand-file-name
    "lsp/readme.org"
    user-emacs-directory))
#+end_src

** UTILS
Installing Evil-Surround
#+begin_src emacs-lisp
  (use-package evil-surround
    :after evil)
#+end_src

Installing Embrace
#+begin_src emacs-lisp
  (use-package embrace)
#+end_src

Installing Evil-Embrace
#+begin_src emacs-lisp
  (use-package evil-embrace
    :after (evil-surround embrace))
#+end_src

Intalling Evil-Commentary
#+begin_src emacs-lisp
  (use-package evil-commentary
    :after evil)
#+end_src

Installing Evil-Goggles
#+begin_src emacs-lisp
  (use-package evil-goggles
    :after evil)
#+end_src

Installing Vterm
#+begin_src emacs-lisp
  (use-package vterm)
#+end_src

Installing Undo-Tree
#+begin_src emacs-lisp
  (use-package undo-tree)
#+end_src

Installing Exec-Path-From-Shell
#+begin_src emacs-lisp
  (use-package exec-path-from-shell)
#+end_src

[[file:utils/readme.org][Configuration]]
#+begin_src emacs-lisp
  (org-babel-load-file
   (expand-file-name
    "utils/readme.org"
    user-emacs-directory))
#+end_src

** GIT
Installing Transient
#+begin_src emacs-lisp
  (use-package transient)
#+end_src

Installing Magit
#+begin_src emacs-lisp
  (use-package magit)
#+end_src

Installing Git-Gutter
#+begin_src emacs-lisp
  (use-package git-gutter)
#+end_src

[[file:git/readme.org][Configuration]]
#+begin_src emacs-lisp
  (org-babel-load-file
   (expand-file-name
    "git/readme.org"
    user-emacs-directory))
#+end_src

** VISUALS
Installing Catppuccin-Theme
#+begin_src emacs-lisp
  (use-package catppuccin-theme
    :config (load-theme 'catppuccin :noconfirm))
#+end_src

Installing Dimmer
#+begin_src emacs-lisp
  (use-package dimmer)
#+end_src

Installing Telephone Line
#+begin_src emacs-lisp
  (use-package telephone-line)
#+end_src

Installing Olivetti
#+begin_src emacs-lisp
  (use-package olivetti)
#+end_src

Installing All-The-Icons
#+begin_src emacs-lisp
  (use-package all-the-icons
    :if (display-graphic-p))
#+end_src

Installing Mixed-Pitch
#+begin_src emacs-lisp
  (use-package mixed-pitch)
#+end_src

[[file:visuals/readme.org][Configuration]]
#+begin_src emacs-lisp
  (org-babel-load-file
   (expand-file-name
    "visuals/readme.org"
    user-emacs-directory))
#+end_src

** ORG
Installing Toc-Org
#+begin_src emacs-lisp
  (use-package toc-org
    :after org)
#+end_src

Installing Org-Modern
#+begin_src emacs-lisp
  (use-package org-modern
    :after org)
#+end_src

Installing Org-Roam
#+begin_src emacs-lisp
  (use-package org-roam
    :after org)
#+end_src

Installing Org-Download
#+begin_src emacs-lisp
  (use-package org-download)
#+end_src

[[file:org/readme.org][Configuration]]
#+begin_src emacs-lisp
  (org-babel-load-file
   (expand-file-name
    "org/readme.org"
    user-emacs-directory))
#+end_src

Installing Org-Fragtog
#+begin_src emacs-lisp
  (use-package org-fragtog
    :after org)
#+end_src
